In [1]:
people = {
    "first": ["Har", 'Jonny', 'Amit'], 
    "last": ["Mesh", 'Harode', 'Shukla'], 
    "email": ["harmesh@gmail.com", 'jonnyharode@email.com', 'amitshukla@email.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first    last                  email
0    Har    Mesh      harmesh@gmail.com
1  Jonny  Harode  jonnyharode@email.com
2   Amit  Shukla   amitshukla@email.com

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [6]:
#change the name
df.columns =['first_name', 'last_name', 'email']

In [7]:
df

  first_name last_name                  email
0        Har      Mesh      harmesh@gmail.com
1      Jonny    Harode  jonnyharode@email.com
2       Amit    Shukla   amitshukla@email.com

In [8]:
#Upper Case
df.columns = [x.upper() for x in df.columns]

df

  FIRST_NAME LAST_NAME                  EMAIL
0        Har      Mesh      harmesh@gmail.com
1      Jonny    Harode  jonnyharode@email.com
2       Amit    Shukla   amitshukla@email.com

In [10]:
#replaces

df.columns =df.columns.str.replace(' ', '_')

df

  FIRST_NAME LAST_NAME                  EMAIL
0        Har      Mesh      harmesh@gmail.com
1      Jonny    Harode  jonnyharode@email.com
2       Amit    Shukla   amitshukla@email.com

In [11]:
#lower

df.columns = [x.lower() for x in df.columns]

df

  first_name last_name                  email
0        Har      Mesh      harmesh@gmail.com
1      Jonny    Harode  jonnyharode@email.com
2       Amit    Shukla   amitshukla@email.com

In [12]:
#rename

df.rename(columns={'first_name' : 'first', 'last_name': 'last'}, inplace=True)

df

   first    last                  email
0    Har    Mesh      harmesh@gmail.com
1  Jonny  Harode  jonnyharode@email.com
2   Amit  Shukla   amitshukla@email.com

In [14]:
#change Data

df.loc[2] = ['Adarsh', 'Sharma', 'adarshsharma@gmail.com']

In [15]:
df

    first    last                   email
0     Har    Mesh       harmesh@gmail.com
1   Jonny  Harode   jonnyharode@email.com
2  Adarsh  Sharma  adarshsharma@gmail.com

In [16]:
df.loc[2, ['last', 'email']] = [ 'Varma', 'adarshvarma@gmail.com']

In [17]:
df

    first    last                  email
0     Har    Mesh      harmesh@gmail.com
1   Jonny  Harode  jonnyharode@email.com
2  Adarsh   Varma  adarshvarma@gmail.com

In [18]:
df.loc[2, ['last']] = 'Sharma'

df

    first    last                  email
0     Har    Mesh      harmesh@gmail.com
1   Jonny  Harode  jonnyharode@email.com
2  Adarsh  Sharma  adarshvarma@gmail.com

In [19]:
df.at[2, ['last']] = 'Varma'

df

    first    last                  email
0     Har    Mesh      harmesh@gmail.com
1   Jonny  Harode  jonnyharode@email.com
2  Adarsh   Varma  adarshvarma@gmail.com

In [20]:
filt = (df['email'] == 'adarshvarma@gmail.com')
df[filt]

    first   last                  email
2  Adarsh  Varma  adarshvarma@gmail.com

In [22]:
filt = (df['email'] == 'adarshvarma@gmail.com')
df[filt]['last'] ='Sharma'

C:\Users\HP\miniconda3\envs\t_flow\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [24]:
filt = (df['email'] == 'adarshvarma@gmail.com')
df.loc[filt,'last'] ='Sharma'

In [25]:
df

    first    last                  email
0     Har    Mesh      harmesh@gmail.com
1   Jonny  Harode  jonnyharode@email.com
2  Adarsh  Sharma  adarshvarma@gmail.com

In [26]:
df['email'].str.lower()

0        harmesh@gmail.com
1    jonnyharode@email.com
2    adarshvarma@gmail.com
Name: email, dtype: object

In [27]:
df['email'] = df['email'].str.lower()

In [28]:
df

    first    last                  email
0     Har    Mesh      harmesh@gmail.com
1   Jonny  Harode  jonnyharode@email.com
2  Adarsh  Sharma  adarshvarma@gmail.com

In [29]:
df['email'].apply(len)

0    17
1    21
2    21
Name: email, dtype: int64

In [30]:
def update_email(email):
    return email.upper()

In [31]:
df['email'].apply(update_email)

0        HARMESH@GMAIL.COM
1    JONNYHARODE@EMAIL.COM
2    ADARSHVARMA@GMAIL.COM
Name: email, dtype: object

In [32]:
df['email'] = df['email'].apply(update_email)

In [33]:
df

    first    last                  email
0     Har    Mesh      HARMESH@GMAIL.COM
1   Jonny  Harode  JONNYHARODE@EMAIL.COM
2  Adarsh  Sharma  ADARSHVARMA@GMAIL.COM

In [34]:
df['email'] = df['email'].apply(lambda x: x.lower())

In [35]:
df

    first    last                  email
0     Har    Mesh      harmesh@gmail.com
1   Jonny  Harode  jonnyharode@email.com
2  Adarsh  Sharma  adarshvarma@gmail.com

In [36]:
df['email'].apply(len)

0    17
1    21
2    21
Name: email, dtype: int64

In [37]:
df.apply(len)

first    3
last     3
email    3
dtype: int64

In [38]:
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [39]:
len(df['email'])

3

In [40]:
df.apply(pd.Series.min)

first                   Adarsh
last                    Harode
email    adarshvarma@gmail.com
dtype: object

In [41]:
df.apply(lambda x: x.min())

first                   Adarsh
last                    Harode
email    adarshvarma@gmail.com
dtype: object

In [42]:
df.applymap(len)

   first  last  email
0      3     4     17
1      5     6     21
2      6     6     21

In [43]:
df.applymap(str.lower)

    first    last                  email
0     har    mesh      harmesh@gmail.com
1   jonny  harode  jonnyharode@email.com
2  adarsh  sharma  adarshvarma@gmail.com

In [48]:
df['first'].map({'Har': 'Harsha', 'Jonny': 'Jone'})

0    Harsha
1      Jone
2       NaN
Name: first, dtype: object

In [49]:
df['first'].replace({'Har': 'Harsha', 'Jonny': 'Jone'})

0    Harsha
1      Jone
2    Adarsh
Name: first, dtype: object

In [50]:
df

    first    last                  email
0     Har    Mesh      harmesh@gmail.com
1   Jonny  Harode  jonnyharode@email.com
2  Adarsh  Sharma  adarshvarma@gmail.com